User_api/app/controllers/api/v1/users_controller.rb

				  def index
				  	p request.headers[:HTTP_EMAIL]
				  	p request.headers[:HTTP_OUTH_TOKEN]
				    @users = User.all
---
SELECT "users".* FROM "users"

				  def create
				    @user = User.new(user_params)

				    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Adarsh"], ["email", "adi@gmail.com"], ["password", "123"], ["created_at", "2016-06-13 17:45:52.591136"], ["updated_at", "2016-06-13 17:45:52.591136"]]